snlkuharlocal/src/DataProcessors/ОбработкаЛогов/ОбработкаЛогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаЛогов</name>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛогов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>фВФоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ДанныеЛогов/ДанныеЛогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЛогов</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Записи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ДанныеЗамеровПроизводительности/ДанныеЗамеровПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗамеровПроизводительности</name>
  <resources>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗамера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Записи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ОбработкаЛогов/ObjectModule.bsl
Функция ПеренестиВДанныеЗамеров(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата();
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ИД_Записи,Данные,Автор,НомерСеанса,НомерСоединения
	|ИЗ
	|	РегистрСведений.ДанныеЛогов КАК ДанныеЛогов
	|ГДЕ
	|	ДатаЗаписи МЕЖДУ &Дата1 И &Дата2	
	|	И (Автор = &Автор ИЛИ &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|	И НЕ Прочитана 
	|УПОРЯДОЧИТЬ ПО
    |	ДатаЗаписи,ИД_Записи
	|";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("Автор", МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Автор", Справочники.Пользователи.ПустаяСсылка()));
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	
	инт_ДлительныеОперации.СообщитьПрогресс("", "Запись логов в РС. К обработке: " + ВсегоСтрок + " записей.");
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ  
		
		//ТД 		= Новый ТаблицаЗначений;
		//ТД.Колонки.Добавить("ДатаЗаписи", 		ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
		//ТД.Колонки.Добавить("ИмяТаблицы", 		ПолучитьОписаниеТиповСтроки(200));
		//ТД.Колонки.Добавить("ВремяОбработки", 	ПолучитьОписаниеТиповЧисла(10, 3));             
		//ТД.Колонки.Добавить("Ссылка", 			Новый ОписаниеТипов(Типы));
		//ТД.Колонки.Добавить("Автор", 				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		//ТД.Колонки.Добавить("ВесЗамера",			ПолучитьОписаниеТиповЧисла(10));
		//ТД.Колонки.Добавить("РежимЗаписи",		ПолучитьОписаниеТиповСтроки(20));			
		
		рРазбора = РегистрыСведений.ДанныеЛогов.РазобратьПакет(Выборка.Данные);
		Если рРазбора.Успешно Тогда
			ЗаписатьПакетВДанныеЗамеров(рРазбора.Данные, Выборка);
			УстановитьФлаг_Прочитана(Выборка.ИД_Записи);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рРазбора);		
		КонецЕсли;		
		
		Сч = Сч + 1;
		Если Сч % 10 = 0 Тогда                   
			ТекстСообщения = СтрШаблон("Запись логов в РС. Обработано: %1 из %2 записей.", Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);					
			//Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов	= Сч;
	Результат.ВремяВыполнения		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЗаписатьПакетВДанныеЗамеров(ДанныеРазбора, Выборка)
	НЗ = РегистрыСведений.ДанныеЗамеровПроизводительности.СоздатьНаборЗаписей();	
	НЗ.Отбор.ИД_Записи.Установить(Выборка.ИД_Записи, Истина);
	
	Сч = 0;
	Для каждого СтрокаД Из ДанныеРазбора Цикл
		Сч = Сч + 1;
		
		Запись = НЗ.Добавить();		
		Запись.НомерЗаписи = Сч;
		
		ЗаполнитьЗначенияСвойств(Запись, СтрокаД);
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "ИД_Записи,Автор,НомерСеанса,НомерСоединения");
		
		Запись.Основание = СтрокаД.Ссылка;
		
		ИмяТ = СтрокуВСтруктуру(СтрокаД.ИмяТаблицы, "Класс,Вид,ДопИнфо", ".");
		
		Запись.ВремяВыполнения = СтрокаД.ВремяОбработки;		
		
		ЗаполнитьЗначенияСвойств(Запись, ИмяТ);		
	КонецЦикла;
	
	НЗ.Записать(Истина);
КонецФункции // ()

Функция УстановитьФлаг_Прочитана(ИД_Записи, Прочитана = Истина)
	Запись = РегистрыСведений.ДанныеЛогов.СоздатьМенеджерЗаписи();
	Запись.ИД_Записи = ИД_Записи;
	Запись.Прочитать();
	
	Если ЗначениеЗаполнено(Запись.ИД_Записи) Тогда
		Запись.Прочитана = Прочитана;
		Запись.Записать();	
	КонецЕсли;
КонецФункции // ()

Функция СтрокуВСтруктуру(Строка, СтрПоля, Разделитель=",")
	Части	= СтрРазделить(Строка,Разделитель);
	Поля	= СтрРазделить(СтрПоля,",");
	
	Результат	= Новый Структура;
	
	Для Сч=1 По Поля.Количество()  Цикл
		Инд=Сч-1;
		Если Сч<=Части.Количество() Тогда
			Результат.Вставить(Поля[Инд],Части[Инд]);
		Иначе
			Результат.Вставить(Поля[Инд],"");			
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ()

Функция ОчиститьДанныеЗамеров(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата();
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ИД_Записи
	|ИЗ
	|	РегистрСведений.ДанныеЗамеровПроизводительности
	|ГДЕ
	|	ДатаЗаписи МЕЖДУ &Дата1 И &Дата2
	|";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	
	инт_ДлительныеОперации.СообщитьПрогресс("", "Очистка записей в РС. К обработке: " + ВсегоСтрок + " записей.");
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ  
		
		НЗ = РегистрыСведений.ДанныеЗамеровПроизводительности.СоздатьНаборЗаписей();
		НЗ.Отбор.ИД_Записи.Установить(Выборка.ИД_Записи, Истина);
		НЗ.Записать();		
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда                   
			ТекстСообщения = СтрШаблон("Запись логов в РС. Обработано: %1 из %2 записей.", Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);								
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов	= Сч;
	Результат.ВремяВыполнения		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
КонецФункции

Функция Сформировать(тПараметры = Неопределено) Экспорт
	пОбработки = Новый Структура;
	пОбработки.Вставить("Дата1", НачалоДня(ТекущаяДата()) - 3*24*60*60);
	пОбработки.Вставить("Дата2", КонецДня(ТекущаяДата()));
	
	ЗаписатьВЛог("Регламент", "Перенос данных замеров производительности. Начало", "Информация");
	
	рОбработки = ПеренестиВДанныеЗамеров(пОбработки);	
	
	ЗаписатьВЛог("Регламент", "Перенос данных замеров производительности. Окончание. Обработано записей: " + рОбработки.ОбработаноОбъектов, "Информация", , , рОбработки.ВремяВыполнения);
КонецФункции //Сформировать(тПараметры = Неопределено) Экспорт
